#include "general.h"

/**
*Data:20200323
//题目：
//企业发放的奖金根据利润提成。
//
//利润(I)低于或等于10万元时，奖金可提10%；
//利润高于10万元，低于20万元时，低于10万元的部分按10%提成，
//高于10万元的部分，可提成7.5%；
//20万到40万之间时，高于20万元的部分，可提成5%；
//40万到60万之间时高于40万元的部分，可提成3%；
//60万到100万之间时，高于60万元的部分，可提成1.5%；
//高于100万元时，超过100万元的部分按1%提成。
//从键盘输入当月利润I，求应发放奖金总数？
*/
double money(void)
{
    double i;
    double bouns[6];
    printf("请输入利润\n");
    scanf("%lf",&i);
    bouns[0]=100000*0.1;
    bouns[1]=bouns[0]+100000*0.075;
    bouns[2]=bouns[1]+200000*0.05;
    bouns[3]=bouns[2]+200000*0.03;
    bouns[4]=bouns[3]+200000*0.015;

    if ( i <= 100000 )
    {
        bouns[5]=i*0.1;
    }
    else if ( i <= 200000 )
    {
        bouns[5]=bouns[0]+(i-100000)*0.075;
    }
    else if ( i <= 400000 )
    {
        bouns[5]=bouns[1]+(i-200000)*0.05;
    }
    else if ( i <= 600000 )
    {
        bouns[5]=bouns[2]+(i-400000)*0.03;
    }
    else if ( i <= 1000000 )
    {
        bouns[5]=bouns[3]+(i-600000)*0.015;
    }
    else if ( i >1000000 )
    {
        bouns[5]=bouns[4]+(i-1000000)*0.01;
    }
    printf("奖金是%f\n",bouns[5]);
    return bouns[5];
}
